       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX1.

       ENVIRONMENT DIVISION.
       DATA DIVISION.


       PROCEDURE DIVISION.
           DISPLAY 'HELLO'.
