       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX10.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77 WRK-CELSIUS PIC 9(03) VALUE ZEROS.
       77 WRK-FARENHEIT PIC 9(03) VALUE ZEROS.
       77 WRK-C PIC 9(03) VALUE ZEROS.

       PROCEDURE DIVISION.

       DISPLAY 'INFORME A TEMPRATURA EM CELSIUS'.
       ACCEPT WRK-CELSIUS FROM CONSOLE.


       COMPUTE WRK-FARENHEIT = WRK-CELSIUS * 1,8 + 32.

       DISPLAY 'A TEMPERATURA EM FARENHEIT E..: 'WRK-FARENHEIT.
