      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Ex14.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       77 WRK-PESO-PEIXE PIC 9(03) VALUE ZEROS.
       77 WRK-EXCESSO-PESO PIC 9(03) VALUE ZEROS.
       77 WRK-EXCESSO-PESO-ED PIC Z99 VALUE ZEROS.
       77 WRK-MULTA PIC 9(04)V99 VALUE ZEROS.
       77 WRK-MULTA-ED PIC ZZ9 VALUE ZEROS.
       77 WRK-CONTADOR PIC 9(03) VALUE ZEROS.


       PROCEDURE DIVISION.


       DISPLAY 'INFORME O PESO DO PEIXE '
       ACCEPT WRK-PESO-PEIXE FROM CONSOLE.

       IF WRK-PESO-PEIXE > 50
           PERFORM VARYING WRK-CONTADOR FROM 51 BY 1
                           UNTIL WRK-CONTADOR > WRK-PESO-PEIXE
           COMPUTE WRK-EXCESSO-PESO = WRK-EXCESSO-PESO + 1
           MOVE WRK-EXCESSO-PESO TO WRK-EXCESSO-PESO-ED
           COMPUTE WRK-MULTA = WRK-MULTA + 4
           MOVE WRK-MULTA TO WRK-MULTA-ED


           END-PERFORM

           DISPLAY 'EXCESSO DE PESOs: ' WRK-EXCESSO-PESO-ED
           DISPLAY 'MULTA: ' WRK-MULTA-ED
           DISPLAY 'CONTADOR ' WRK-CONTADOR

       ELSE
           DISPLAY 'EXCESSO DE PESO: ' WRK-EXCESSO-PESO
           DISPLAY 'MULTA: ' WRK-MULTA
       END-IF.
       STOP RUN.
