      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Ex14.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77 WRK-PESO-PEIXE PIC 9(03) VALUE ZEROS.

       PROCEDURE DIVISION.

       STOP RUN.
