      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-GANHA-HORA PIC 9(03)V99 VALUE ZEROS.
       77 WRK-NM-HORAS-MES PIC 9(03) VALUE ZEROS.

       77 WRK-SALARIO-MES PIC 9(05)V99 VALUE ZEROS.
       77 WRK-IMPOSTO-RENDA PIC 9(05)V99 VALUE ZEROS.
       77 WRK-INSS PIC 9(04)V99 VALUE ZEROS.
       77 WRK-INSS-ED PIC Z99 VALUE ZEROS.
       77 WRK-SINDICATO PIC 9(04)V99 VALUE ZEROS.
       77 WRK-SINDICATO-ED PIC Z999 VALUE ZEROS.
       77 WRK-SALARIO-BRUTO PIC 9(05)V99 VALUE ZEROS.
       77 WRK-SALARIO-BRUTO-ED PIC Z9999 VALUE ZEROS.
       77 WRK-SALARIO-LIQUIDO PIC 9(05)V99 VALUE ZEROS.
       77 WRK-SALARIO-LIQUIDO-ED PIC ZZ9999 VALUE ZEROS.
       PROCEDURE DIVISION.


       DISPLAY 'INFORME QUANTO GANHA POR HORA'
       ACCEPT WRK-GANHA-HORA FROM CONSOLE.

       DISPLAY 'INFORME O NUMERO HORAS TRABALHADAS NO MES '
       ACCEPT WRK-NM-HORAS-MES FROM CONSOLE.

       COMPUTE WRK-SALARIO-BRUTO = WRK-GANHA-HORA * WRK-NM-HORAS-MES.
       COMPUTE WRK-INSS = (8 / 100) * WRK-SALARIO-BRUTO.
       COMPUTE WRK-SINDICATO = (5 / 100) * WRK-SALARIO-BRUTO.
       COMPUTE WRK-SALARIO-LIQUIDO =
                      WRK-SALARIO-BRUTO - WRK-INSS - WRK-SINDICATO.

       MOVE WRK-INSS TO WRK-INSS-ED.
       MOVE WRK-SALARIO-BRUTO TO WRK-SALARIO-BRUTO-ED.
       MOVE WRK-SINDICATO TO WRK-SINDICATO-ED.


       DISPLAY 'SALARIO BRUTO: ' WRK-SALARIO-BRUTO-ED.
       DISPLAY 'PAGOU AO INSS: ' WRK-INSS-ED.
       DISPLAY 'PAGOU AO SINDICATO: ' WRK-SINDICATO-ED.
       DISPLAY 'SALARIO LIQUIDO: ' WRK-SALARIO-LIQUIDO.

       STOP RUN.
