
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX16.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-ARQUIVO-MB PIC 9(03) VALUE ZEROS.
       77 WRK-VELOCIDADE-NET PIC 9(04) VALUE ZEROS.
       77 WRK-TEMPO PIC 9(03) VALUE ZEROS.
       77 WRK-TEMPO-ED PIC Z99 VALUE ZEROS.



       PROCEDURE DIVISION.

       DISPLAY 'INFORME O TAMANHO DO ARQUIVO EM MB '
       ACCEPT WRK-ARQUIVO-MB FROM CONSOLE.

       DISPLAY 'INFORME A VELOCIDADE DA INTERNET'
       ACCEPT WRK-VELOCIDADE-NET FROM CONSOLE.

       COMPUTE WRK-TEMPO = WRK-ARQUIVO-MB / (WRK-VELOCIDADE-NET / 8)

       MOVE WRK-TEMPO TO WRK-TEMPO-ED.

       DISPLAY 'UM ARQUIVO DE ' WRK-ARQUIVO-MB ' BAIXADO A '
                WRK-VELOCIDADE-NET  ' = ' WRK-TEMPO-ED ' SEGUNDOS'.


       STOP RUN.
