
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX16.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NM1 PIC 9(04) VALUE ZEROS.
       77 WRK-NM2 PIC 9(04) VALUE ZEROS.
       77 WRK-NM1-ED PIC Z99 VALUE ZEROS.
       77 WRK-NM2-ED PIC Z99 VALUE ZEROS.
       PROCEDURE DIVISION.

       DISPLAY 'INFORME UM NUMERO'
       ACCEPT WRK-NM1 FROM CONSOLE.

       DISPLAY 'INFORME OUTRO NUMERO'
       ACCEPT WRK-NM2 FROM CONSOLE.


       MOVE WRK-NM1 TO WRK-NM1-ED.
       MOVE WRK-NM2 TO WRK-NM2-ED.

       IF WRK-NM1 GREATER THAN WRK-NM2
           DISPLAY 'NUMERO MAIOR' WRK-NM1-ED
       ELSE
           IF WRK-NM2 GREATER THAN WRK-NM1
               DISPLAY 'NUMERO MAIOR' WRK-NM2-ED
       ELSE
           IF WRK-NM1 EQUAL TO WRK-NM2
               DISPLAY 'NUMERO IGUAIS'



       STOP RUN.
