
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX19.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-SEXO PIC A(01) VALUE SPACES.




       PROCEDURE DIVISION.
       DISPLAY 'INFORME SEU SEXO'
       ACCEPT WRK-SEXO FROM CONSOLE.

       EVALUATE WRK-SEXO
           WHEN 'F'
               DISPLAY 'FEMININO'
           WHEN 'M'
               DISPLAY 'MASCULINO'
           WHEN OTHER
               DISPLAY 'SEXO INVALIDO'
       END-EVALUATE

       STOP RUN.
