
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX20.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-LETRA PIC A(01) VALUE SPACES.


       PROCEDURE DIVISION.
       DISPLAY 'INFORME UMA VOGAL OU UMA CONSOANTE'
       ACCEPT WRK-LETRA FROM CONSOLE.

       IF WRK-LETRA EQUAL TO 'A' OR
          WRK-LETRA EQUAL TO 'E' OR
          WRK-LETRA EQUAL TO 'I' OR
          WRK-LETRA EQUAL TO 'O' OR
          WRK-LETRA EQUAL TO 'U'
       DISPLAY 'VOGAL'
       ELSE
           DISPLAY 'CONSOANTE'
       END-IF.

       STOP RUN.
