       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX21.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       77 WRK-NT1 PIC 9(02)V99 VALUE ZEROS.
       77 WRK-NT2 PIC 9(02)V99 VALUE ZEROS.
       77 WRK-MEDIA PIC 9(04)V99 VALUE ZEROS.
       77 WRK-MEDIA-ED PIC Z99 VALUE ZEROS.


       PROCEDURE DIVISION.

       DISPLAY 'INFORME A PRIMEIRA NOTA'
       ACCEPT WRK-NT1 FROM CONSOLE.

       DISPLAY 'INFORME A SEGUNDA NOTA'
       ACCEPT WRK-NT2 FROM CONSOLE.

       COMPUTE WRK-MEDIA = (WRK-NT1 + WRK-NT2) / 2


       IF WRK-MEDIA EQUAL TO 10
           DISPLAY 'APROVADO COM DISTINCAO'
       ELSE
           IF WRK-MEDIA GREATER THAN 7 OR
               WRK-MEDIA EQUAL TO 7
               DISPLAY 'APROVADO'
       ELSE
           DISPLAY 'REPROVADO'


       END-IF


       STOP RUN.
