
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX22.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NM1 PIC 9(03) VALUE ZEROS.
       77 WRK-NM2 PIC 9(03) VALUE ZEROS.
       77 WRK-NM3 PIC 9(03) VALUE ZEROS.


       PROCEDURE DIVISION.
       DISPLAY 'INFORME O PRIMEIRO NUMERO'
       ACCEPT WRK-NM1 FROM CONSOLE.

       DISPLAY 'INFORME O SEGUNDO NÚMERO'
       ACCEPT WRK-NM2 FROM CONSOLE.

       DISPLAY 'INFORME O TERCEIRO NÚMERO'
       ACCEPT WRK-NM3 FROM CONSOLE.





       STOP RUN.
