
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX24.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 WRK-PRODUTO.
           05 WRK-PRODUTO1-NOME PIC X(20) VALUE SPACES.
           05 WRK-PRODUTO1-VALOR PIC 9(05)V99 VALUE ZEROS.
           05 WRK-PRODUTO2-NOME PIC X(20) VALUE SPACES.
           05 WRK-PRODUTO2-VALOR PIC 9(04)V99 VALUE ZEROS.
           05 WRK-PRODUTO3-NOME PIC X(20) VALUE SPACES.
           05 WRK-PRODUTO3-VALOR PIC 9(04)V99 VALUE ZEROS.
           05 WRK-PRODUTO1-VALOR-ED PIC Z99 VALUE ZEROS.
           05 WRK-PRODUTO2-VALOR-ED PIC Z99 VALUE ZEROS.
           05 WRK-PRODUTO3-VALOR-ED PIC Z99 VALUE ZEROS.


       PROCEDURE DIVISION.
       DISPLAY 'INFORME O NOME DO PRIMEIRO PRODUTO'.
       ACCEPT WRK-PRODUTO1-NOME FROM CONSOLE.

       DISPLAY 'INFORME O VALOR DO PRIMEIRO PRODUTO'.
       ACCEPT WRK-PRODUTO1-VALOR FROM CONSOLE.

       DISPLAY '------------------------------------'.
       DISPLAY 'INFORME O NOME DO SEGUNDO PRODUTO'.
       ACCEPT WRK-PRODUTO2-NOME FROM CONSOLE.

       DISPLAY 'INFORME O VALOR DO SEGUNDO PRODUTO'.
       ACCEPT WRK-PRODUTO2-VALOR FROM CONSOLE.

       DISPLAY '-----------------------------------'.
       DISPLAY 'INFORME O NOME DO TERCEIRO PRODUTO'.
       ACCEPT WRK-PRODUTO3-NOME FROM CONSOLE.

       DISPLAY 'INFORME O VALOR DO TERCEIRO PRODUTO'.
       ACCEPT WRK-PRODUTO3-VALOR FROM CONSOLE.

       MOVE WRK-PRODUTO1-VALOR TO WRK-PRODUTO1-VALOR-ED.
       MOVE WRK-PRODUTO2-VALOR TO WRK-PRODUTO2-VALOR-ED.
       MOVE WRK-PRODUTO3-VALOR TO WRK-PRODUTO3-VALOR-ED.


       IF WRK-PRODUTO1-VALOR < WRK-PRODUTO2-VALOR
          AND WRK-PRODUTO1-VALOR < WRK-PRODUTO3-VALOR
          DISPLAY 'O mais barato e: ' WRK-PRODUTO1-NOME
          DISPLAY 'Com o preco: ' WRK-PRODUTO1-VALOR-ED
       ELSE
           IF WRK-PRODUTO2-VALOR < WRK-PRODUTO1-VALOR
              AND WRK-PRODUTO2-VALOR < WRK-PRODUTO3-VALOR
              DISPLAY 'O mais barato e: 'WRK-PRODUTO2-NOME
              DISPLAY 'Com o preco: ' WRK-PRODUTO2-VALOR-ED
       ELSE
           IF WRK-PRODUTO3-VALOR < WRK-PRODUTO2-VALOR
               AND WRK-PRODUTO3-VALOR < WRK-PRODUTO1-VALOR
              DISPLAY 'O mais barato e: ' WRK-PRODUTO3-NOME
              DISPLAY 'Com o preco: ' WRK-PRODUTO3-VALOR-ED
       END-IF.


       STOP RUN.
