
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX25.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 WRK-NUMEROS.
           05 WRK-NUM1 PIC 9(04) VALUE ZEROS.
           05 WRK-NUM2 PIC 9(04) VALUE ZEROS.
           05 WRK-NUM3 PIC 9(04) VALUE ZEROS.



       PROCEDURE DIVISION.




       STOP RUN.
