
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX27.
       AUTHOR: LUAN MAGALHAES
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-SALARIO PIC 9(05)V99 VALUE ZEROS.
       77 WRK-REAJUSTE PIC 9(05)V99 VALUE ZEROS.
       77 WRK-REAJUSTE-ED PIC Z999 VALUE ZEROS.
       77 WRK-SALARIO-ED PIC Z999 VALUE ZEROS.

       PROCEDURE DIVISION.
       DISPLAY 'INFORME SEU NOVO SALARIO'.
       ACCEPT WRK-SALARIO FROM CONSOLE.


       IF WRK-SALARIO < 281,00
           COMPUTE WRK-REAJUSTE = (20 / 100) *
           WRK-SALARIO + WRK-SALARIO
           MOVE WRK-REAJUSTE TO WRK-REAJUSTE-ED
           MOVE WRK-SALARIO TO WRK-SALARIO-ED
           DISPLAY 'SALARIO ANTES DO REAJUSTE: ' WRK-SALARIO-ED
           DISPLAY 'AUMENTO DE 20%'
           DISPLAY 'NOVO SALARIO: ' WRK-REAJUSTE-ED
       ELSE
           IF WRK-SALARIO IS GREATER THAN 280,00
               AND WRK-SALARIO IS LESS THAN 701,00
           COMPUTE WRK-REAJUSTE = (15/100) * WRK-SALARIO + WRK-SALARIO
           MOVE WRK-REAJUSTE TO WRK-REAJUSTE-ED
           MOVE WRK-SALARIO TO WRK-SALARIO-ED
           DISPLAY'SALARIO ANTES DO REAJUSTE ' WRK-SALARIO-ED
           DISPLAY 'AUMENTO DE 15%'
           DISPLAY 'NOVO SALARIO: ' WRK-REAJUSTE-ED
       ELSE
           IF WRK-SALARIO IS GREATER THAN 701,00
               AND WRK-SALARIO IS LESS THAN 1500,00
           COMPUTE WRK-REAJUSTE = (10 /100) * WRK-SALARIO + WRK-SALARIO
           MOVE WRK-REAJUSTE TO WRK-REAJUSTE-ED
           MOVE WRK-SALARIO TO WRK-SALARIO-ED
           DISPLAY 'SALARIO ANTES DO REAJUSTE'  WRK-SALARIO-ED
           DISPLAY 'AUMENTO DE 10%'
           DISPLAY 'NOVO SALARIO: ' WRK-REAJUSTE-ED
       ELSE
      *>      IF WRK-SALARIO IS GREATER THAN 1500,00
      *>          COMPUTE WRK-REAJUSTE = (5/100) *
      *>          WRK-SALARIO + WRK-SALARIO
      *>          MOVE WRK-REAJUSTE TO WRK-REAJUSTE-ED
      *>          MOVE WRK-SALARIO TO WRK-SALARIO-ED
      *>          DISPLAY 'SALARIO ANTES DO REAJUSTE ' WRK-SALARIO-ED
      *>          DISPLAY 'AUMENTO DE 5% '
      *>          DISPLAY 'NOVO SALARIO ' WRK-REAJUSTE-ED
       END-IF
       STOP RUN.
