
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX29.
       AUTHOR: LUAN MAGALHAES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 WRK-NOTA.
           05 WRK-NT1 PIC 9(03)V99 VALUE ZEROS.
           05 WRK-NT2 PIC 9(03)V99 VALUE ZEROS.

       77 WRK-MEDIA PIC 9(03)V99 VALUE ZEROS.
       77 WRK-MEDIA-ED PIC Z99 VALUE ZEROS.


       PROCEDURE DIVISION.
       DISPLAY 'INFORME A PRIMEIRA NOTA'
       ACCEPT WRK-NT1 FROM CONSOLE.

       DISPLAY 'INFORME A SEGUNDA NOTA'
       ACCEPT WRK-NT2 FROM CONSOLE.


       COMPUTE WRK-MEDIA = (WRK-NT1 + WRK-NT2) / 2.

       EVALUATE WRK-MEDIA
           WHEN 9,00 THRU 10,00
               DISPLAY 'CONCEITO A'
           WHEN 7,50 THRU 8,99
               DISPLAY 'CONCEITO B'
           WHEN 6,00 THRU 6,99
               DISPLAY 'CONCEITO C'
           WHEN 4,00 THRU 5,99
               DISPLAY 'CONCEITO D'
           WHEN 0,0 THRU 3,99
               DISPLAY 'CONCEITO E'
       END-EVALUATE.



       STOP RUN.
