       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX31.
       AUTHOR. LUAN MAGALHAES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-A PIC S9(03) VALUE ZEROS.
       77 WRK-B PIC S9(03) VALUE ZEROS.
       77 WRK-C PIC S9(03) VALUE ZEROS.

       77 WRK-CALC1 PIC 9(03) VALUE ZEROS.
       77 WRK-CALC2 PIC 9(03) VALUE ZEROS.
       77 WRK-CALC3 PIC 9(03) VALUE ZEROS.
       77 WRK-RAIZ PIC 9(03) VALUE ZEROS.
       77 WRK-DELTA-POSITIVO PIC S9(04)V99 VALUE ZEROS.
       77 WRK-DELTA-NEGATIVO PIC S9(04)V99 VALUE ZEROS.
       77 WRK-DELTA-POSITIVO-ED PIC Z999 VALUE ZEROS.
       77 WRK-DELTA-NEGATIVO-ED PIC Z999 VALUE ZEROS.

       PROCEDURE DIVISION.

       DISPLAY 'INFORME VALOR DE A'
       ACCEPT WRK-A FROM CONSOLE.


       IF WRK-A EQUAL TO ZEROS
           DISPLAY 'VALOR INVALIDO'
       ELSE
           DISPLAY 'INFORME O VALOR DE B'
           ACCEPT WRK-B FROM CONSOLE

           DISPLAY 'INFORME O VALOR DE C'
           ACCEPT WRK-C FROM CONSOLE
       END-IF.


       COMPUTE WRK-CALC1 = (WRK-B ** 2) + 4 * 1 * WRK-C
       COMPUTE WRK-CALC2 = FUNCTION SQRT(WRK-CALC1)
       COMPUTE WRK-DELTA-POSITIVO = (- WRK-B + WRK-CALC2) / 2
       COMPUTE WRK-DELTA-NEGATIVO = (- WRK-B - WRK-CALC2) / 2

       MOVE WRK-DELTA-POSITIVO TO WRK-DELTA-POSITIVO-ED
       MOVE WRK-DELTA-NEGATIVO TO WRK-DELTA-NEGATIVO-ED
       IF WRK-DELTA-POSITIVO IS LESS THAN 0
           OR WRK-DELTA-NEGATIVO IS LESS THAN 0
           DISPLAY 'RESULTADO POSITIVO: ' WRK-DELTA-POSITIVO-ED
           DISPLAY 'RESULTADO NEGATIVO: ' WRK-DELTA-NEGATIVO-ED
           DISPLAY 'A EQUACAO NAO POSSUI RAIZES REAIS'
       ELSE
           IF WRK-DELTA-POSITIVO EQUAL TO 0
               OR WRK-DELTA-POSITIVO IS LESS THAN 0
               DISPLAY 'RESULTADO POSITIVO: ' WRK-DELTA-POSITIVO-ED
               DISPLAY 'RESULTADO NEGATIVO: ' WRK-DELTA-NEGATIVO-ED
               DISPLAY 'POSSUI APENAS UMA RAIZ REAL'
       ELSE
           DISPLAY 'RESULTADO POSITIVO: ' WRK-DELTA-POSITIVO-ED
           DISPLAY 'RESULTADO NEGATIVO: ' WRK-DELTA-NEGATIVO-ED
           DISPLAY 'POSSUI DUAS RAIZES REAIS'







       STOP RUN.
