       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX29.
       AUTHOR: LUAN MAGALHAES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 WRK-TRIANGULO.
               05 WRK-LADO1 PIC 9(03) VALUE ZEROS.
               05 WRK-LADO2 PIC 9(03) VALUE ZEROS.
               05 WRK-LADO3 PIC 9(03) VALUE ZEROS.
       77 WRK-SOMA-TRIANGULO PIC 9(03) VALUE ZEROS.


       PROCEDURE DIVISION.
       DISPLAY 'INFORME O PRIMEIRO LADO'
       ACCEPT WRK-LADO1 FROM CONSOLE.

       DISPLAY 'INFORME O SEGUNDO LADO'
       ACCEPT WRK-LADO2 FROM CONSOLE.

       DISPLAY 'INFORME O TERCEIRO LADO'
       ACCEPT WRK-LADO3 FROM CONSOLE.

       COMPUTE WRK-SOMA-TRIANGULO = WRK-LADO1 + WRK-LADO2


       IF WRK-SOMA-TRIANGULO IS GREATER THAN WRK-LADO3
           IF WRK-LADO1 EQUAL TO WRK-LADO2 EQUAL TO WRK-LADO3
               DISPLAY 'TRIANGULO EQUILATERO'
       END-IF.






       STOP RUN.
