       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX32.
       AUTHOR. LUAN MAGALHAES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-ANO PIC 9(04) VALUE ZEROS.
       77 WRK-DIVISAO PIC 9(04) VALUE ZEROS.
       77 WRK-RESTO PIC 9(04) VALUE ZEROS.
       PROCEDURE DIVISION.
       DISPLAY 'INFORME UM ANO'.
       ACCEPT WRK-ANO FROM CONSOLE.

       DIVIDE WRK-ANO BY 4 GIVING WRK-DIVISAO
           REMAINDER WRK-RESTO.

       IF WRK-RESTO EQUAL TO 0
           DISPLAY 'ANO BISSEXTO'
       ELSE
           DISPLAY 'NAO E ANO BISSEXTO'
       END-IF

       STOP RUN.
