       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX33.
       AUTHOR. LUAN MAGALHAES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NM PIC 9(02) VALUE ZEROS.
       77 WRK-VALOR PIC 9(02) VALUE ZEROS.
       77 WRK-PAR-IMPAR PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
       DISPLAY 'INFORME UM VALOR'
       ACCEPT WRK-NM FROM CONSOLE.

       DIVIDE WRK-NM BY 2 GIVING WRK-VALOR REMAINDER WRK-PAR-IMPAR.



       IF WRK-PAR-IMPAR EQUAL TO 0
           DISPLAY 'PAR'
       ELSE
           DISPLAY 'IMPAR'
       END-IF.
       STOP RUN.
