       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX36.
       AUTHOR. LUAN MAGALHAES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.


       STOP RUN.
