       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX37.
       AUTHOR. LUAN MAGALHAES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-QTDEMORANGO PIC 9(04) VALUE ZEROS.
       77 WRK-QTDEMACA PIC 9(04) VALUE ZEROS.
       77 WRK-VALOR-PAGAR-MORANGO PIC 9(04)V99 VALUE ZEROS.
	      77 WRK-VALOR-PAGAR-MACA PIC 9(04)V99 VALUE ZEROS.
       77 WRK-VALOR-PAGAR-MORANGO-ED PIC Z99,99 VALUE ZEROS.
	      77 WRK-VALOR-PAGAR-MACA-ED PIC Z99,99 VALUE ZEROS.
       77 WRK-DESCONTO-MORANGO PIC 9(04)V99 VALUE ZEROS.
       77 WRK-DESCONTO-MACA PIC 9(04)V99 VALUE ZEROS.
       77 WRK-PAGAR-MORANGO PIC 9(04)V99 VALUE ZEROS.
       77 WRK-PAGAR-MACA PIC 9(04)V99 VALUE ZEROS.
       77 WRK-PAGAR-MACA-ED PIC Z99,99 VALUE ZEROS.
       77 WRK-PAGAR-MORANGO-ED PIC Z99,99 VALUE ZEROS.



       PROCEDURE DIVISION.

       DISPLAY 'INFORME A QUANTIDADE EM KG DO MORANGO'
       ACCEPT WRK-QTDEMORANGO FROM CONSOLE.

       DISPLAY 'INFORME A QUANTIDADE DE KG DE MACA'
       ACCEPT WRK-QTDEMACA FROM CONSOLE.

       DISPLAY ''
       IF WRK-QTDEMORANGO <=5
           COMPUTE WRK-VALOR-PAGAR-MORANGO = WRK-QTDEMORANGO * 2,50
           MOVE WRK-VALOR-PAGAR-MORANGO TO WRK-VALOR-PAGAR-MORANGO-ED
           DISPLAY 'ABAIXO DE 5KG, VALOR A PAGAR NO MORANGO '
           WRK-VALOR-PAGAR-MORANGO-ED
           DISPLAY ''
       END-IF.

       IF WRK-QTDEMACA <=5
           COMPUTE WRK-VALOR-PAGAR-MACA = WRK-QTDEMACA * 1,80
           MOVE WRK-VALOR-PAGAR-MACA TO WRK-VALOR-PAGAR-MACA-ED
           DISPLAY 'ABAIXO DE 5KG, VALOR A PAGAR NO MACA '
           WRK-VALOR-PAGAR-MACA-ED
           DISPLAY ''
       END-IF.

       IF (WRK-QTDEMORANGO >5) AND
          (WRK-QTDEMORANGO <=8)

           COMPUTE WRK-VALOR-PAGAR-MORANGO = WRK-QTDEMORANGO * 2,20
           MOVE WRK-VALOR-PAGAR-MORANGO TO WRK-VALOR-PAGAR-MORANGO-ED
           DISPLAY 'ACIMA DE 5KG, VALOR PAGAR MORANGO'
           WRK-VALOR-PAGAR-MORANGO-ED
           DISPLAY ''


       END-IF

       IF WRK-QTDEMACA >5 AND WRK-QTDEMACA <=8

       COMPUTE WRK-VALOR-PAGAR-MACA = WRK-QTDEMACA * 1,50
           MOVE WRK-VALOR-PAGAR-MACA TO WRK-VALOR-PAGAR-MACA-ED
           DISPLAY 'ACIMA DE 5KG, VALOR MACA'
           WRK-VALOR-PAGAR-MACA-ED
           DISPLAY ''
       END-IF

       IF WRK-QTDEMORANGO > 8 OR
               WRK-VALOR-PAGAR-MORANGO > 25,00
               COMPUTE WRK-VALOR-PAGAR-MORANGO = WRK-QTDEMORANGO * 2,20
               COMPUTE WRK-DESCONTO-MORANGO = (10 / 100) *
               WRK-VALOR-PAGAR-MORANGO
               COMPUTE WRK-PAGAR-MORANGO = WRK-VALOR-PAGAR-MORANGO
               - WRK-DESCONTO-MORANGO
               MOVE WRK-PAGAR-MORANGO TO WRK-PAGAR-MORANGO-ED


               DISPLAY 'ACIMA DE 8KG'
               DISPLAY 'OU ACIMA DE 25 REAIS  '
               DISPLAY 'VALOR A PAGAR MORANGO ' WRK-PAGAR-MORANGO-ED




       END-IF


       IF WRK-QTDEMACA > 8 OR WRK-VALOR-PAGAR-MACA > 25,00
               COMPUTE WRK-VALOR-PAGAR-MACA= WRK-QTDEMACA * 1,50
               COMPUTE WRK-DESCONTO-MACA = (10 / 100) *
               WRK-VALOR-PAGAR-MACA
               COMPUTE WRK-PAGAR-MACA = WRK-VALOR-PAGAR-MACA
               - WRK-DESCONTO-MACA
               MOVE WRK-PAGAR-MACA TO WRK-PAGAR-MACA-ED

               DISPLAY 'ACIMA DE 8KG'
               DISPLAY 'OU ACIMA DE 25 REAIS  '
               DISPLAY 'VALOR A PAGAR MACA ' WRK-PAGAR-MACA-ED
       END-IF

       STOP RUN.
