       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX39.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NOTA PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.
       0100-INICIAR SECTION.
       PERFORM 0200-ENTRADA.



       0200-ENTRADA SECTION.

       DISPLAY 'INFORME UMA NOTA ENTRE 0 E 10'
       ACCEPT WRK-NOTA FROM CONSOLE.


       PERFORM UNTIL WRK-NOTA IS GREATER THAN 0  AND
                     WRK-NOTA IS GREATER THAN 10
           DISPLAY 'INFORME UM VALOR: '
           ACCEPT WRK-NOTA FROM CONSOLE
       END-PERFORM

       DISPLAY 'VALOR INVALIDO'


       STOP RUN.
