       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX41.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC A(09) VALUE SPACES.
       77 WRK-IDADE PIC 9(03) VALUE ZEROS.
       77 WRK-SALARIO PIC 9(04)V99 VALUE ZEROS.
       77 WRK-SEXO PIC A(01) VALUE SPACES.
       77 WRK-ESTADO-CIVIL PIC A(01) VALUE SPACES.
       77 WRK-CONT PIC 9(02) VALUE ZEROS.
       77 WRK-I PIC 9(02) VALUE ZEROS.
       77 WRK-RESULTADO PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.

       0100-INICIAR SECTION.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.

       0200-ENTRADA SECTION.
       DISPLAY 'INFORME O NOME'
       ACCEPT WRK-NOME FROM CONSOLE.

       DISPLAY 'INFORME A IDADE'
       ACCEPT WRK-IDADE FROM CONSOLE.

       DISPLAY 'INFORME O SALARIO'
       ACCEPT WRK-SALARIO FROM CONSOLE.

       DISPLAY 'INFORME O SEXO'
       ACCEPT WRK-SEXO FROM CONSOLE.

       DISPLAY 'INFORME O ESTADO CIVIL'
       ACCEPT WRK-ESTADO-CIVIL FROM CONSOLE.


       0300-PROCESSAR SECTION.

       COMPUTE WRK-RESULTADO = FUNCTION BYTE-LENGTH (WRK-NOME)
       DISPLAY 'QUANTIDADE DE BYTES: ' WRK-RESULTADO


       IF WRK-IDADE IS GREATER THAN 0 AND
           WRK-IDADE IS LESS THAN 150
           DISPLAY 'IDADE ENTRE 0 E 150'
       END-IF


       IF WRK-SALARIO IS GREATER THAN 0
           DISPLAY 'SALARIO MAIOR QUE 0'
       END-IF

       EVALUATE WRK-SEXO
           WHEN 'M'
           WHEN 'm'
           DISPLAY 'Masculino'

           WHEN 'F'
           WHEN 'f'
           DISPLAY 'feminino'

           WHEN OTHER
           DISPLAY 'SEXO INVALIDO'
       END-EVALUATE

       EVALUATE WRK-ESTADO-CIVIL
           WHEN 'S'
           WHEN 's'
           DISPLAY 'SOLTEIRO'

           WHEN 'C'
           WHEN 'c'
           DISPLAY 'CASADO'


           WHEN 'V'
           WHEN 'v'
           DISPLAY 'Viuvo'


           WHEN 'D'
           WHEN 'd'
           DISPLAY 'Divorciado'
       WHEN OTHER
           DISPLAY 'RELACIONAMENTO INVALIDO'
       END-EVALUATE
       STOP RUN.
