       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX42.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.



       PROCEDURE DIVISION.




       STOP RUN.
