       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX42.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-I PIC 9(02) VALUE 1.


       PROCEDURE DIVISION.
       0100-INICIAR       SECTION.
       PERFORM 0200-EXECUTAR.

       0200-EXECUTAR      SECTION.
       PERFORM VARYING WRK-I FROM 1 BY 1 UNTIL WRK-I >20
           DISPLAY WRK-I
       END-PERFORM


       STOP RUN.
