       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX43.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-PAISA PIC 9(05) VALUE 80000.
       77 WRK-PAISB PIC 9(06) VALUE 200000.
       77 WRK-PORCENTAGEMA PIC 9(03) VALUE ZEROS.
       77 WRK-PORCENTAGEMB PIC 9(03) VALUE ZEROS.
       77 WRK-CONT PIC 9(01) VALUE ZEROS.


       PROCEDURE DIVISION.
       0100-INICIAR   SECTION.
       PERFORM 0200-PROCESSAR.


       0200-PROCESSAR SECTION.
       PERFORM UNTIL WRK-PAISA > WRK-PAISB
           COMPUTE WRK-PAISA = WRK-PAISA + WRK-PORCENTAGEMA
           ADD 1 TO WRK-CONT
       END-PERFORM

       DISPLAY 'pais a ' WRK-PAISA
       DISPLAY 'ANOS: 'WRK-CONT

       STOP RUN.
