       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX43.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NUMERO PIC 9(02) VALUE ZEROS.
       77 WRK-I PIC 9(03) VALUE 1.
       77 WRK-AUX PIC 9(02) VALUE ZEROS.


       PROCEDURE DIVISION.
       0100-INICIAR   SECTION.
       PERFORM 0300-PROCESSAR.




       0300-PROCESSAR SECTION.
       PERFORM VARYING WRK-I FROM 1 BY 1 UNTIL WRK-I > 5
           DISPLAY 'INFORME UM NUMERO'
           ACCEPT WRK-NUMERO FROM CONSOLE

           IF WRK-NUMERO > WRK-AUX
             MOVE WRK-NUMERO TO WRK-AUX
           END-IF

       END-PERFORM


       DISPLAY 'MAIOR: ' WRK-AUX




       STOP RUN.
