       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX44.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-VALOR PIC 9(02) VALUE ZEROS.
       77 WRK-I PIC 9(02) VALUE 01.

       PROCEDURE DIVISION.

       PERFORM VARYING WRK-I FROM 1 BY 1 UNTIL WRK-I > 10
           ADD 1 TO WRK-VALOR

       END-PERFORM

       DISPLAY 'VALOR: ' WRK-VALOR



       STOP RUN.
