       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX45.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NUMERO PIC 9(02) VALUE ZEROS.
       77 WRK-I PIC 9(02) VALUE 1.
       77 WRK-SOMA PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.
       0100-INICAR SECTION.
       PERFORM 0200-PROCESSAR.



       0200-PROCESSAR  SECTION.
       PERFORM VARYING WRK-I FROM 1 BY 1 UNTIL WRK-I  > 5
           DISPLAY 'INFORME O NUMERO'
           ACCEPT WRK-NUMERO FROM CONSOLE

           COMPUTE WRK-SOMA = WRK-SOMA + WRK-NUMERO

       END-PERFORM

       DISPLAY 'A SOMA E ' WRK-SOMA

       STOP RUN.
