       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX46.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 WRK-NUMERO PIC 9(03) VALUE ZEROS.
       77 WRK-I PIC 9(02) VALUE ZEROS.
       77 WRK-SOMA PIC 9(03) VALUE ZEROS.
       77 WRK-MEDIA PIC 9(03)V99 VALUE ZEROS.


       PROCEDURE DIVISION.
       0100-INICIAR SECTION.
       PERFORM 0200-ENTRADA.
       PERFORM 0250-PROCESSAR.
       PERFORM 0300-EXIBIR.

       0200-ENTRADA SECTION.

       PERFORM VARYING WRK-I FROM 1 BY 1 UNTIL WRK-I > 5
       DISPLAY 'INFORME UM NUMERO'
       ACCEPT WRK-NUMERO FROM CONSOLE

       COMPUTE WRK-SOMA = WRK-SOMA + WRK-NUMERO


       END-PERFORM.

       0250-PROCESSAR SECTION.

       COMPUTE WRK-MEDIA = WRK-SOMA / 5.




       0300-EXIBIR SECTION.
       DISPLAY 'A SOMA E: ' WRK-SOMA
       DISPLAY 'MEDIA' WRK-MEDIA





       STOP RUN.
