       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX49.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-HELLO PIC X(15) VALUE SPACES.

       PROCEDURE DIVISION.

       0100-INICIAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.
       STOP RUN.



       0200-ENTRADA.
       DISPLAY 'DIGITE A FRASE QUE DESEJA GUARDAR'.
       ACCEPT WRK-HELLO FROM CONSOLE.


       0300-PROCESSAR.
       DISPLAY 'A FRASE DIGITADA FOI: ' WRK-HELLO.
