       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX50.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-VALOR PIC 9(3) VALUE ZEROS.


       PROCEDURE DIVISION.
       0100-INICIAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.
       STOP RUN.

       0200-ENTRADA.
       DISPLAY 'ENTRE COM O VALOR'
       ACCEPT WRK-VALOR FROM CONSOLE.


       0300-PROCESSAR.
       DISPLAY 'O VALOR INFORMADO FOI: ' WRK-VALOR.
