       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX53.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NM1 PIC 9(03) VALUE ZEROS.
       77 WRK-NM2 PIC 9(03) VALUE ZEROS.
       77 WRK-NM3 PIC 9(03) VALUE ZEROS.
       77 WRK-NM4 PIC 9(03) VALUE ZEROS.
       77 WRK-MEDIA PIC 9(04) VALUE ZEROS.
       77 WRK-MEDIA-ED PIC Z999 VALUE ZEROS.

       PROCEDURE DIVISION.

       0100-INICIAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.
       STOP RUN.

       0200-ENTRADA.
       DISPLAY 'INFORME O PRIMEIRO NUMERO'
       ACCEPT WRK-NM1 FROM CONSOLE.


       DISPLAY 'INFORME O SEGUNDO NUMERO'.
       ACCEPT WRK-NM2 FROM CONSOLE.


       DISPLAY 'INFORME O TERCEIRO NUMERO'
       ACCEPT WRK-NM3 FROM CONSOLE.


       DISPLAY 'INFORME O QUARTO NUMERO'
       ACCEPT WRK-NM4 FROM CONSOLE.



       0300-PROCESSAR.
       COMPUTE WRK-MEDIA = (WRK-NM1 + WRK-NM2 + WRK-NM3 + WRK-NM4) / 4.

       DISPLAY 'A MEDIA E: ' WRK-MEDIA.
