       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX55.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-RAIO PIC 9(04) VALUE ZEROS.
       77 WRK-AREA PIC 9(04) VALUE ZEROS.


       PROCEDURE DIVISION.

       0100-INICIAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAMENTO.
       STOP RUN.

       0200-ENTRADA.
       DISPLAY 'INFORMANDO O RAIO '.
       ACCEPT WRK-RAIO FROM CONSOLE.






       0300-PROCESSAMENTO.

       COMPUTE WRK-AREA = 3,14 * (WRK-RAIO * WRK-RAIO).

       DISPLAY ' A AREA É: 'WRK-AREA.
