       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX56.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-AREA PIC 9(04) VALUE ZEROS.
       77 WRK-RESULT PIC 9(04) VALUE ZEROS.

       PROCEDURE DIVISION.

       0100-INICAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.
       STOP RUN.



       0200-ENTRADA.
       DISPLAY ' INFORME A AREA DO QUADRADO'.
       ACCEPT WRK-AREA FROM CONSOLE.


       0300-PROCESSAR.

       COMPUTE WRK-RESULT = (WRK-AREA * WRK-AREA) * 2.
       DISPLAY 'O RESULTADO É: 'WRK-RESULT.
