       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX58.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-FARENHEIT PIC 9(03) VALUE ZEROS.
       77  WRK-CELSIUS   PIC 9(03) VALUE ZEROS.
       77  WRK-CELSIUS-ED PIC Z99 VALUE ZEROS.

       PROCEDURE DIVISION.


       0100-INICIAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.

       STOP RUN.


       0200-ENTRADA.
           DISPLAY 'INFORME A TEMPERATURA EM FARENHEIT'
           ACCEPT WRK-FARENHEIT FROM CONSOLE.


       0300-PROCESSAR.

           COMPUTE WRK-CELSIUS = (5 * (WRK-FARENHEIT - 32) /9).
           MOVE WRK-CELSIUS TO WRK-CELSIUS-ED.

           DISPLAY 'A TEMPERATURA E....' WRK-CELSIUS-ED
           ' GRAUS CELSIUS '.
