       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX59.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-NM1 PIC 9(02) VALUE ZEROS.
       77  WRK-NM2 PIC 9(02) VALUE ZEROS.
