       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX59.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-NM1 PIC 9(02) VALUE ZEROS.
       77  WRK-NM2 PIC 9(02) VALUE ZEROS.
       77  WRK-NM3 PIC 9(02)V99 VALUE ZEROS.
       77  WRK-PRODUTO PIC 9(04) VALUE ZEROS.
       77  WRK-SOMA PIC 9(04) VALUE ZEROS.
       77  WRK-ELEVADO-CUBO PIC 9(04) VALUE ZEROS.

       PROCEDURE DIVISION.

       0100-INICIAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAR.
       STOP RUN.


       0200-ENTRADA.
       DISPLAY 'INFORME O PRIMEIRO VALOR'
       ACCEPT WRK-NM1 FROM CONSOLE.


       DISPLAY 'INFORME O SEGUNDO VALOR'.
       ACCEPT WRK-NM2 FROM CONSOLE.

       DISPLAY 'INFORME O TERCEIRO VALOR'
       ACCEPT WRK-NM3 FROM CONSOLE.



       0300-PROCESSAR.

       COMPUTE WRK-PRODUTO = ( WRK-NM1 * 2 ) * (WRK-NM2 / 2).
       COMPUTE WRK-SOMA    = ( WRK-NM1 * 3) + WRK-NM3.
       COMPUTE WRK-ELEVADO-CUBO = (WRK-NM3 * 3).


       DISPLAY 'PRODUTO...' WRK-PRODUTO
       DISPLAY 'SOMA....' WRK-SOMA
       DISPLAY 'ELAVADO AO CUBO ' WRK-ELEVADO-CUBO.
