       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX60.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-ALTURA PIC 9(03)V99 VALUE ZEROS.
       77 WRK-PESO-IDEAL PIC 9(03) VALUE ZEROS.

       PROCEDURE DIVISION.

       0100-INICAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAMENTO.
       STOP RUN.

       0200-ENTRADA.
       DISPLAY 'INFORME SUA ALTURA'.
       ACCEPT WRK-ALTURA FROM CONSOLE.




       0300-PROCESSAMENTO.
       COMPUTE WRK-PESO-IDEAL = (72,7 * WRK-ALTURA) - 58.
       DISPLAY 'SEU PESO IDEAL ' WRK-PESO-IDEAL.
