       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX60.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-MB PIC 9(04) VALUE ZEROS.
       77 WRK-VELOCIDADE-NET PIC 9(03) VALUE ZEROS.
       77 WRK-RESULT PIC 9(04) VALUE ZEROS.

       PROCEDURE DIVISION.

       0100-INICAR.
       PERFORM 0200-ENTRADA.
       PERFORM 0300-PROCESSAMENTO.
       STOP RUN.

       0200-ENTRADA.
       DISPLAY 'INFORME O TAMANHO EM MB'.
       ACCEPT WRK-MB FROM CONSOLE.


       DISPLAY 'INFORME A VELOCIDADE DE UM LINK'.
       ACCEPT WRK-VELOCIDADE-NET FROM CONSOLE.



       0300-PROCESSAMENTO.
       COMPUTE WRK-RESULT = WRK-MB / (WRK-VELOCIDADE-NET/8).
       DISPLAY 'TEMPO DOWNLOAD ' WRK-RESULT.
