       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX8.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       77 WRK-GANHA-HORA PIC 9(04) VALUE ZEROS.
       77 WRK-NUM-HORAS-TRABALHADA PIC 9(04) VALUE ZEROS.
       77 WRK-SALARIO PIC 9(06) VALUE ZEROS.
       77 WRK-SALARIO-ED PIC Z9999 VALUE ZEROS.

       PROCEDURE DIVISION.

       DISPLAY 'INFORME QUANTO VOCE GANHA POR HORA'
       ACCEPT WRK-GANHA-HORA FROM CONSOLE.

       DISPLAY 'INFORME A QUANTIDADE DE HORAS TRABALHADAS NO MÊS'
       ACCEPT WRK-NUM-HORAS-TRABALHADA FROM CONSOLE.


       COMPUTE WRK-SALARIO = WRK-GANHA-HORA * WRK-NUM-HORAS-TRABALHADA.
       MOVE WRK-SALARIO TO WRK-SALARIO-ED.

       DISPLAY 'SALARIO: ' WRK-SALARIO-ED.
