       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX9.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       77 WRK-FARENHEIT PIC 9(3) VALUE ZEROS.
       77 WRK-CELSIUS PIC 9(3) VALUE ZEROS.
       77 WRK-F PIC 9(3) VALUE ZEROS.

       PROCEDURE DIVISION.

       DISPLAY 'INFORME A TEMPERATURA EM FARENHEIT'.
       ACCEPT WRK-FARENHEIT FROM CONSOLE.

       COMPUTE WRK-F = WRK-FARENHEIT - 32.

       COMPUTE WRK-CELSIUS = (5 * WRK-F) / 9.

       DISPLAY 'CELSIUS..: ' WRK-CELSIUS.



       STOP RUN.
